# логический тип

b1 = True
b2 = False

# целый тип (1)

i = 1 # int

# bytes 0-255 последовательность чисел

# вещественный тип (1.2)

f = 1.2 # float

# комлексные числа == сложные числа (встречаться с ними не будешь, пока не попадешь в Big Data или в сложные задачи математические)

comp = complex(1, 2) # complex

# str => string => строка

s = "Hello World"

# СЛОЖНЫЕ ПЕРЕМЕННЫЕ

# array == array[] => массив
# list == усовершеноствованный массив
# set ==  list + имеет только уникальные значения 1 24 2 24 6 5 => 1 24 2 6 5



# hard way
# tuple ==
# dict == example : name : 'Tommy' , age : 24


